In [1]:
import numpy as np
import pandas as pd

# Dataset in set operation by SQL

---
# Basic

## tbl_a

In [5]:
tbl_a = pd.DataFrame({
    'key':['a', 'b', 'c'],
    'col_1':[2, 0, 5],
    'col_2':[3, 7, 1],
    'col_3':[4, 9, 6]
})
tbl_a

  key  col_1  col_2  col_3
0   a      2      3      4
1   b      0      7      9
2   c      5      1      6

In [6]:
tbl_b = pd.DataFrame({
    'key':['a', 'b', 'c'],
    'col_1':[2, 0, 5],
    'col_2':[3, 7, 1],
    'col_3':[4, 9, 6]
})
tbl_b

  key  col_1  col_2  col_3
0   a      2      3      4
1   b      0      7      9
2   c      5      1      6

In [8]:
tbl_c = pd.DataFrame({
    'key':['a','b','c'],
    'col_1':[2,0,5],
    'col_2':[3,7,1],
    'col_3':[4,8,6]
})
tbl_c

  key  col_1  col_2  col_3
0   a      2      3      4
1   b      0      7      8
2   c      5      1      6

In [9]:
tbl_a.to_csv('../../dataset/set_operation_by_sql/tbl_a.csv', index = False)
tbl_b.to_csv('../../dataset/set_operation_by_sql/tbl_b.csv', index = False)
tbl_c.to_csv('../../dataset/set_operation_by_sql/tbl_c.csv', index = False)

---
# skills and empskills

In [12]:
skills = pd.DataFrame({
    'skill':['oracle', 'unix', 'java']
})
skills

    skill
0  oracle
1    unix
2    java

In [13]:
empskills = pd.DataFrame({
    'emp':['aida']*4 + ['kanzaki']*3 + ['hirai']*5 + ['wakatabe', 'watarai'],
    'skill':['oracle', 'unix', 'java', 'c#', 'oracle', 'unix', 'java', 'unix', 'oracle', 'php', 'perl', 'c++', 'perl', 'oracle']
})
empskills

         emp   skill
0       aida  oracle
1       aida    unix
2       aida    java
3       aida      c#
4    kanzaki  oracle
5    kanzaki    unix
6    kanzaki    java
7      hirai    unix
8      hirai  oracle
9      hirai     php
10     hirai    perl
11     hirai     c++
12  wakatabe    perl
13   watarai  oracle

In [14]:
skills.to_csv('../../dataset/set_operation_by_sql/skills.csv', index = False)
empskills.to_csv('../../dataset/set_operation_by_sql/empskills.csv', index = False)

---
# supparts

In [19]:
sup = ['a']*3 + ['b']*2 + ['c']*3 + ['d']*2 + ['e']*3 + ['f']
sup

['a', 'a', 'a', 'b', 'b', 'c', 'c', 'c', 'd', 'd', 'e', 'e', 'e', 'f']

In [20]:
part = ['bolt', 'nut', 'pipe', 'bolt', 'pipe', 'bolt', 'nut', 'pipe',
       'bolt', 'pipe', 'fuse', 'nut', 'pipe', 'fuse']
part

['bolt',
 'nut',
 'pipe',
 'bolt',
 'pipe',
 'bolt',
 'nut',
 'pipe',
 'bolt',
 'pipe',
 'fuse',
 'nut',
 'pipe',
 'fuse']

In [21]:
supparts = pd.DataFrame({
    'sup':sup,
    'part':part
})
supparts

   sup  part
0    a  bolt
1    a   nut
2    a  pipe
3    b  bolt
4    b  pipe
5    c  bolt
6    c   nut
7    c  pipe
8    d  bolt
9    d  pipe
10   e  fuse
11   e   nut
12   e  pipe
13   f  fuse

In [22]:
supparts.to_csv('../../dataset/set_operation_by_sql/supparts.csv', index = False)

---
# Products

In [2]:
Products = pd.DataFrame({
    'name':['apple', 'orange', 'orange', 'orange', 'banana'],
    'price':[50, 100, 100, 100, 80],
})

Products

     name  price
0   apple     50
1  orange    100
2  orange    100
3  orange    100
4  banana     80

In [ ]:
Products.to_csv('../../dataset/')